{"@context":"http://schema.org","url":"https://www.delish.com/cooking/recipe-ideas/a38018000/gingerbread-house-recipe/","publisher":{"@type":"Organization","name":"Delish","logo":{"@type":"ImageObject","url":"https://assets.hearstapps.com/sites/delish/assets/images/logos/logo-jsonld.58eed96.png","width":219,"height":60}},"@type":"Recipe","author":{"name":"Jason Schreiber","@type":"Person"},"datePublished":"2021-10-28T21:39:50.177983Z","headline":"Easy Gingerbread House","image":{"@type":"ImageObject","height":5348,"thumbnail":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-gingerbread-house-beauty-2-1634934057.jpg?crop=0.495xw:0.741xh;0.447xw,0.211xh&resize=100:*","url":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-gingerbread-house-beauty-2-1634934057.jpg","width":8019},"mainEntityOfPage":{"@id":"https://www.delish.com/cooking/recipe-ideas/a38018000/gingerbread-house-recipe/","@type":"WebPage"},"thumbnailUrl":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-gingerbread-house-beauty-2-1634934057.jpg?crop=0.495xw:0.741xh;0.447xw,0.211xh&resize=100:*","isAccessibleForFree":"False","hasPart":[{"@type":"WebPageElement","isAccessibleForFree":"False","cssSelector":".content-container"}],"name":"Easy Gingerbread House","prepTime":"PT0S","cookTime":"PT0S","totalTime":"PT5H15M","recipeIngredient":["4 2/3 c. <p>&nbsp;all-purpose flour, plus more for surface</p>\r\n<p><strong></strong></p>\r\n<p><strong></strong></p><strong>\r\n<p>more for surface</p>\r\n</strong><p><strong></strong></p>\r\n<p><strong></strong></p>\r\n<p><strong></strong></p>","4 tsp. <p>ground ginger</p>","2 tsp. <p>ground cinnamon</p>","1 1/2 tsp. <p>baking soda</p>","1 tsp. <p>kosher salt</p>","<p>Pinch ground nutmeg</p>","<p>Pinch ground cloves</p>","6 tbsp. <p>butter, melted</p>","1/2 c. <p>firmly packed light brown sugar</p>","1 1/4 c. <p>unsulfured molasses</p>","3 <p>large egg whites</p>","<p>Pinch kosher salt</p>","4 c. <p>(about 1 lb.) powdered sugar, divided&nbsp;</p>","1 tsp. <p>white vinegar, lemon juice, or water, as needed</p>","<p>Graham crackers</p>","<p>Pretzel sticks</p>","<p>Old-fashioned chocolate wafer cookies</p>","<p>Candy canes and peppermints</p>","<p>Mike and Ikes</p>","<p>Nerds</p>","<p>Bite-size Italian wafer cookies (such as Quadratini)</p>","<p>Gumdrops</p>","<p>Shredded coconut</p>"],"recipeInstructions":"In a large bowl, whisk together flour, ginger, cinnamon, baking soda, salt, nutmeg, and cloves. In a medium bowl, whisk&nbsp;together melted butter, brown&nbsp;sugar, and molasses until dissolved. Make a well in the flour mixture&nbsp;and pour in melted butter mixture.&nbsp;Stir with a rubber spatula until no&nbsp;dry patches remain. (Add a little&nbsp;water, up to 1 tablespoon, to bring&nbsp;dough together if necessary.) Turn out dough onto a clean&nbsp;work surface and knead gently to&nbsp;form a ball. Divide the dough in half&nbsp;and form each into a 1\" thick disk&nbsp;then wrap in plastic. Refrigerate&nbsp;until firm, at least 4 hours, or up&nbsp;to 2 days. Repeat steps to make a&nbsp;second batch of dough. Preheat oven to 375º with a&nbsp;rack in the center position. Line&nbsp;three rimmed baking sheets with&nbsp;parchment paper. Print and cut out the gingerbread&nbsp;house templates. Working with one disk at a time,&nbsp;roll dough on a lightly floured work&nbsp;surface to 1⁄4\" thick. Use a pizza&nbsp;wheel or sharp knife to cut around&nbsp;the gingerbread house templates,&nbsp;cutting two of each shape. (Gather&nbsp;and refrigerate scraps while you're working with remaining dough;&nbsp;they can be rerolled once.) Transfer&nbsp;gingerbread cutouts to baking&nbsp;sheets, leaving 1\" of space around&nbsp;each, and freeze until firm, 15&nbsp;minutes. Bake gingerbread cookies one&nbsp;tray at a time, until puffed and&nbsp;firm, about 28 minutes. Let cool&nbsp;on baking sheets 5 minutes, then&nbsp;transfer to wire racks to cool&nbsp;completely. Assemble house with&nbsp;Royal Icing and decorate.<br> In a large bowl using a hand mixer or the bowl of a stand mixer using the paddle attachment, beat egg whites and salt on medium speed until frothy. Add 1⁄2 cup powdered sugar and continue mixing on low speed until sugar is moistened. Increase to medium speed and beat 20 seconds.&nbsp;Continue adding powdered sugar&nbsp;in batches until the mixture forms a&nbsp;thick paste. (If using a hand mixer,&nbsp;use a rubber spatula once mixture&nbsp;is thick.)<br> Stir in vinegar a little at a time,&nbsp;mixing well, until icing resembles&nbsp;the consistency of toothpaste.&nbsp;Adjust texture by adding vinegar or&nbsp;powdered sugar as needed.<br>      Transfer about 1½ cups royal icing to a piping bag fitted with a coupler and a ¼\" round tip. Keep remaining icing in bowl, covered with plastic pressed directly on the surface to prevent it from drying out. Pipe a generous bead of frosting on the bottom and one vertical edge of one side of the gingerbread house and position on a serving platter or board. Hold the piece upright, while you pipe a bead of frosting along the bottom edge of a perpendicular side of the house. Affix the second side of the house to the board forming a corner with the first piece. Insert T-pins through the corner to stabilize while the icing dries or place sturdy glasses or cans around the gingerbread pieces to balance. Pipe a generous bead of icing on the inside corner and bottom edge of both pieces.&nbsp; Repeat with the remaining two sides of the house. Let stand undisturbed in a cool, dry place until the icing sets, at least 4 hours, preferably overnight. Pipe a generous bead of frosting along the roofline of the house. Affix the roof pieces, using T-pins or tall glasses to hold them in place while the icing dries, at least 4 hours or overnight. Remove when the icing has dried.","video":[],"recipeCuisine":["American"],"recipeCategory":["vegetarian","Christmas","dessert"],"recipeYield":"1","description":"Perfection isn’t the name of the game here. Bake the foundation of the house, raid the candy aisle, and decorate your heart out.","keywords":"American, Christmas, dessert, vegetarian"}